'Zalgo Hunt
'Made by Zachary Maarse
'January 16-20, 2017
'Initial start-up screen
'Background retrieved from http://vignette3.wikia.nocookie.net/steamtradingcards/images/6/60/Call_of_Cthulhu_The_Wasted_Land_Background_The_Face_of_the_End.jpg/revision/latest?cb=20141127120932
Public Class frmTitleScreen
    Private Sub frmTitleScreen_KeyDown(sender As Object, e As KeyEventArgs) Handles Me.KeyDown
        If e.KeyCode = Keys.Enter Then
            Me.Hide()
            frmZalgo.Show()
            attempts = 0
            frmZalgo.lblAttempts.Text = attempts
            souls = 10
            frmZalgo.lblSouls.Text = 10
            totalMunitions = 5
            frmZalgo.lblMunitions.Text = 5
            totalTime = 60
            frmZalgo.lblTimeLeft.Text = 60
        End If
    End Sub

    Private Sub tmrWordFlash_Tick(sender As Object, e As EventArgs) Handles tmrWordFlash.Tick
        If lblEnter.Visible = True Then
            lblEnter.Visible = False
        ElseIf lblEnter.Visible = False Then
            lblEnter.Visible = True
        End If
        If lblTitle.Text = "h̭̺̠̥̲̦̪͍̫̜̫̖͇̘͉̼̻̉͐ͤ̆ͦ̌̈̆̉U̜͇̮̼̭͚̝̖̯͈̮̓̔̓͛ͬͥ͌̊ͯͣ́̈́̐N̳̤͉̞̠̱̯̩͎̝̮̠̮̱̗̆̄͒̾ͧ̽̔͋̚T̥̜̟̗̩͓̻͈̦̩̰͌̊̃͗͌͆ͫ͋͗̓ͨͧ̔́ͬ͋ͤ̚ͅ ͉̻̮͉͓̬̦͓͂ͫ̊̔t̖̭̯͍̪͎̘̲̩͈̜̺̟̃̋̐ͣ̈́͗̊͂ͅH͖̹̮͚͕͇̙̦̭͑̓̓ͪ̆ͯ̍̚E̤̗̟̰͕̝̯̹̱͖̳̼͙̘̗ͦ͐̂ͮͦ̓͒͊̈́̔̄̿͋ͣ̉͐ ̩͇̣̤̥̳̳̳̖̪͍ͧ͐͛̈z̰̯̱̠̰͉͉͖̜̩̳͔͗̏ͪͪ̅̉̐͐̄͗̄ͫ͒ͭͥ̒̚Ä͔̘̼͎̠͔͓́͊̐͊̑̔L̞̭͍̈͑̑̅G̞̜̫̭̗̖͍͙̗̥̤͈̪ͪ̆͋̅̒̿͛̿̈́͗̾͑̈̈̾̅̄̚O͈̟͈̙ͦ̉̄͐̀̄ͭ͆̍͑̈́͂" Then
            lblTitle.Text = "h͙̫͎͖̫̥̺͂̽ͧ̉ͬͯ̊ͯ̒ͥ̋ͤ̈́ͬU̱̹̻͍̾ͤ̏̑̅ͮN͔̯̩̬̦͑̀ͪͫ́̋̓T̙͔̖͙̙͍͚̲̻̮̻̪͇̜̣̗̲͕̍́͊ͬ̅̓ ̬̘͈̖͖̙͖̲̾̉͊̽͋ͩͤͥͪ̽ͥ͑ͯ̓̎͊t̝̭͈͔̰̘̰̫̬͚̪̰͙̐ͩ̉ͨ̓́ͩ̃͛̅ͤ̎͗̈̅̓̑ͬͮͅH̦͓͎͓̞̩̯͈͕̗̬̝̘̓͆͐͊̌̍̽̿̉̔ͯ̓̌ͦ̐͋E̺̪̪̗͓̠͗̽ͬͭ ͎͚̜͔͓̩͙̝̬͚͖͓̥̦̥̰̦̻ͭ̍ͥͫz̮͎͇͖̮̼̮̪̩͚̐ͥ̓̏̂Å͕̺̦̻̱͓̰̳̥̥͇͕̮̏́́͒ͥ̌̚ͅL̮͈͔̦̥͔͖͓̝͙͈̟͕ͫͣ̆̊ͫ̌̌̍̋̿̏̒ͣ̒̋͋̅G̮̲͉͚̊̒͆ͦ̈͆̇̓͗̂̑̿̚Ȯ̼͕̣̱̱̫̭͉͙͈̙͈̠̘̪͖͚̭̑̋͌̌̊́ͮ̃̈́̑̋͊͗"
        ElseIf lblTitle.Text = "h͙̫͎͖̫̥̺͂̽ͧ̉ͬͯ̊ͯ̒ͥ̋ͤ̈́ͬU̱̹̻͍̾ͤ̏̑̅ͮN͔̯̩̬̦͑̀ͪͫ́̋̓T̙͔̖͙̙͍͚̲̻̮̻̪͇̜̣̗̲͕̍́͊ͬ̅̓ ̬̘͈̖͖̙͖̲̾̉͊̽͋ͩͤͥͪ̽ͥ͑ͯ̓̎͊t̝̭͈͔̰̘̰̫̬͚̪̰͙̐ͩ̉ͨ̓́ͩ̃͛̅ͤ̎͗̈̅̓̑ͬͮͅH̦͓͎͓̞̩̯͈͕̗̬̝̘̓͆͐͊̌̍̽̿̉̔ͯ̓̌ͦ̐͋E̺̪̪̗͓̠͗̽ͬͭ ͎͚̜͔͓̩͙̝̬͚͖͓̥̦̥̰̦̻ͭ̍ͥͫz̮͎͇͖̮̼̮̪̩͚̐ͥ̓̏̂Å͕̺̦̻̱͓̰̳̥̥͇͕̮̏́́͒ͥ̌̚ͅL̮͈͔̦̥͔͖͓̝͙͈̟͕ͫͣ̆̊ͫ̌̌̍̋̿̏̒ͣ̒̋͋̅G̮̲͉͚̊̒͆ͦ̈͆̇̓͗̂̑̿̚Ȯ̼͕̣̱̱̫̭͉͙͈̙͈̠̘̪͖͚̭̑̋͌̌̊́ͮ̃̈́̑̋͊͗" Then
            lblTitle.Text = "h̟͓̮̱̖͖̜̏̿͗ͭ̈ͦ͒͊̔ͥ̋ͣ̾́̽U̠̦̻̯͈̯̣̥̩͆͑ͦ̿̒͋͌ͅN͍̘̗͉̝̂ͮ̈́ͭ̎̎ͬ̐̒͒͗ͮT̪̣̗͎̐ͨ̋ͨ́̓̿̋̈́ͨͩ̉̄́̽̄ͮ ͚̬̦͔̭̤̲̥̻̝̝̬̠͈̮͔͆̀ͭͩͥ͐̋̐ͧͥt̻̯͈͈̫͙͕͓̩͓̺̣̫̠͖̲̄ͧͪ͑̓̉̂̃ͪ̆́̆̓̋̃ͩ͋ͬH͈͈̙̻͍͙͍̹̖̹̹̯̝͎ͫ̌̔́ͮ͑̄ͬ͗̀͊̿̌́̃̌̍E̱̲͍̜͇͕̜̫̱̫̱̭̮ͮ͂͛̀ͩ̿͐͐̍̎ͫͅͅͅ ̮̼̠̦̘͇̘͓͍̫̟̺̗̼̲̗̬ͥ͆̅ͤͮ͆̌̊ͪ͆̾z̖̬̰̗̩̭͎͚̥̱̙͈͓̳͍̐ͮ̅̓͌̈ͥͅA̗̗͎͚̼̖͚͕̤̭͗̾̑̆̿̍̍̎̂͗ͨḶ̻͙̪̑͂̀̆̆̉ͦ̎͋̉ͨ͊G̤̗̪͇̜̺̰̖̩̦̬̳̹͙̟̈͊́ͧ̅̅̃͊̌ͅȎ̜̙͎̜̲̫͎̳̇̔ͣ̌̇̐̾̃̊̾͑ͩ̉ͬ"
        ElseIf lblTitle.Text = "h̟͓̮̱̖͖̜̏̿͗ͭ̈ͦ͒͊̔ͥ̋ͣ̾́̽U̠̦̻̯͈̯̣̥̩͆͑ͦ̿̒͋͌ͅN͍̘̗͉̝̂ͮ̈́ͭ̎̎ͬ̐̒͒͗ͮT̪̣̗͎̐ͨ̋ͨ́̓̿̋̈́ͨͩ̉̄́̽̄ͮ ͚̬̦͔̭̤̲̥̻̝̝̬̠͈̮͔͆̀ͭͩͥ͐̋̐ͧͥt̻̯͈͈̫͙͕͓̩͓̺̣̫̠͖̲̄ͧͪ͑̓̉̂̃ͪ̆́̆̓̋̃ͩ͋ͬH͈͈̙̻͍͙͍̹̖̹̹̯̝͎ͫ̌̔́ͮ͑̄ͬ͗̀͊̿̌́̃̌̍E̱̲͍̜͇͕̜̫̱̫̱̭̮ͮ͂͛̀ͩ̿͐͐̍̎ͫͅͅͅ ̮̼̠̦̘͇̘͓͍̫̟̺̗̼̲̗̬ͥ͆̅ͤͮ͆̌̊ͪ͆̾z̖̬̰̗̩̭͎͚̥̱̙͈͓̳͍̐ͮ̅̓͌̈ͥͅA̗̗͎͚̼̖͚͕̤̭͗̾̑̆̿̍̍̎̂͗ͨḶ̻͙̪̑͂̀̆̆̉ͦ̎͋̉ͨ͊G̤̗̪͇̜̺̰̖̩̦̬̳̹͙̟̈͊́ͧ̅̅̃͊̌ͅȎ̜̙͎̜̲̫͎̳̇̔ͣ̌̇̐̾̃̊̾͑ͩ̉ͬ" Then
            lblTitle.Text = "h̲̙̰͔̼͔̜̥͚̗̩̯͎̞̓̿̋ͦ̈́͗̇̂Ü͓͍̼̫͈͈̯̬͉̪͓̹͈͊ͨ̀͐̂ͦ̐́ͮ̓ͫN͔̹̠̱̝͎̰͔͈̙̹̒ͯ̎̅ͪ̏ͧ͑ͣ̑T͉͔̰̗͙̺̱̰̟̺̳̣̤ͩ̓̂̏ͤ͐̒ͩ̀ͪ͑̊̓̍͐̑͂ͩ ͎̦̟͕̺͇̟̝͎̯͙̩̳͙̼͗̾̾̒͂t̼̠̠̗͇͇̫͚̥͕̖̤̳̠̍̋̈̓͗̆͋̉̾͆ͦ̑́ͅͅH̱̖̫̩͓̣͉̬͈̯̼̘̮̜̖̞ͬͤ̈́͆̓ͧͥͅE̲̭̲̝̪͛̋ͬͤͥ̃ͅ ̺͈̲͇́͗͋ͮ͑͆̒̄́͛̆z͙̯̯̳̻͂͊̈́͆̄̎̍̍̔͆̐̓̈́̂ͅA̲͓͔̮̯̖͖͈̬ͥͨͪ̒ͧ̒͆̌ͭͬL̜̞͕̤̜̲͓͍͓̹͓͛͌̾ͣ̏͂̈́͒̂̊̋ͩ̈G̥̭͙̯̬̣̤̲̹̠͙͍̬̘͔͖̦͕̈̾̐̄̓͛̓͛̄̇͊̒͆ͮ̉O͖̱̘̫̗͈͍̞͈͉͙͓̞̺͌̒͂̌͋͗̃́̉̆ͬ"
        ElseIf lblTitle.Text = "h̲̙̰͔̼͔̜̥͚̗̩̯͎̞̓̿̋ͦ̈́͗̇̂Ü͓͍̼̫͈͈̯̬͉̪͓̹͈͊ͨ̀͐̂ͦ̐́ͮ̓ͫN͔̹̠̱̝͎̰͔͈̙̹̒ͯ̎̅ͪ̏ͧ͑ͣ̑T͉͔̰̗͙̺̱̰̟̺̳̣̤ͩ̓̂̏ͤ͐̒ͩ̀ͪ͑̊̓̍͐̑͂ͩ ͎̦̟͕̺͇̟̝͎̯͙̩̳͙̼͗̾̾̒͂t̼̠̠̗͇͇̫͚̥͕̖̤̳̠̍̋̈̓͗̆͋̉̾͆ͦ̑́ͅͅH̱̖̫̩͓̣͉̬͈̯̼̘̮̜̖̞ͬͤ̈́͆̓ͧͥͅE̲̭̲̝̪͛̋ͬͤͥ̃ͅ ̺͈̲͇́͗͋ͮ͑͆̒̄́͛̆z͙̯̯̳̻͂͊̈́͆̄̎̍̍̔͆̐̓̈́̂ͅA̲͓͔̮̯̖͖͈̬ͥͨͪ̒ͧ̒͆̌ͭͬL̜̞͕̤̜̲͓͍͓̹͓͛͌̾ͣ̏͂̈́͒̂̊̋ͩ̈G̥̭͙̯̬̣̤̲̹̠͙͍̬̘͔͖̦͕̈̾̐̄̓͛̓͛̄̇͊̒͆ͮ̉O͖̱̘̫̗͈͍̞͈͉͙͓̞̺͌̒͂̌͋͗̃́̉̆ͬ" Then
            lblTitle.Text = "h̭̺̠̥̲̦̪͍̫̜̫̖͇̘͉̼̻̉͐ͤ̆ͦ̌̈̆̉U̜͇̮̼̭͚̝̖̯͈̮̓̔̓͛ͬͥ͌̊ͯͣ́̈́̐N̳̤͉̞̠̱̯̩͎̝̮̠̮̱̗̆̄͒̾ͧ̽̔͋̚T̥̜̟̗̩͓̻͈̦̩̰͌̊̃͗͌͆ͫ͋͗̓ͨͧ̔́ͬ͋ͤ̚ͅ ͉̻̮͉͓̬̦͓͂ͫ̊̔t̖̭̯͍̪͎̘̲̩͈̜̺̟̃̋̐ͣ̈́͗̊͂ͅH͖̹̮͚͕͇̙̦̭͑̓̓ͪ̆ͯ̍̚E̤̗̟̰͕̝̯̹̱͖̳̼͙̘̗ͦ͐̂ͮͦ̓͒͊̈́̔̄̿͋ͣ̉͐ ̩͇̣̤̥̳̳̳̖̪͍ͧ͐͛̈z̰̯̱̠̰͉͉͖̜̩̳͔͗̏ͪͪ̅̉̐͐̄͗̄ͫ͒ͭͥ̒̚Ä͔̘̼͎̠͔͓́͊̐͊̑̔L̞̭͍̈͑̑̅G̞̜̫̭̗̖͍͙̗̥̤͈̪ͪ̆͋̅̒̿͛̿̈́͗̾͑̈̈̾̅̄̚O͈̟͈̙ͦ̉̄͐̀̄ͭ͆̍͑̈́͂"
        End If
    End Sub

    Private Sub lblTitle_Click(sender As Object, e As EventArgs) Handles lblTitle.Click

    End Sub
End Class
